[
  {
    "id": "arg246334",
    "issue": "christianity-or-atheism",
    "stance_on_topic": "atheism",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "As humans, we cannot know exactly if there is a higher force or not. Christianity however is not it. Firstly because it is not one belief that every Christian shares, it lacks solidarity. I compare it to a road with all different kinds of sideways. Ask a question about religion, and lots of people will find one of those sideways to adjust their religion to their personal beliefs. <br/> With AtheÌøsm, the concept is pretty clear. It is more scientific, and I like that."
  },
  {
    "id": "12414",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "I vote \"Wrong\". It goes against human nature and, as other fellow voters have mentioned, the definition of \"Marriage\". <br/> And you can't exclude religion from this argument, because thats what happened when people don't have faith or belief in any religion. Religion is there to act as guidelines to what is right and what is wrong. Religion is a way of life. Without it, we're lost."
  },
  {
    "id": "389",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "it-has-a-cute-logo-oh-and-extensions-err-add-ons",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Firefox is more respectful of W3C internet standards while  soft sucks by trying to force us to use their own standards to keep their monopoly."
  },
  {
    "id": "arg33126",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "personal-pursuit",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "Helping others for the common good can give you a feeling of pride but you have to have the means to be able to help the other person. To have those means you first have to have personal pursuit. I don't think one is better than the other but you first have to have personal pursuit before you can have common good. However for some people their personal pursuit can be the advancement of the common good."
  },
  {
    "id": "arg168836",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "no-it-is-raffles",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Farquhar has a boss!(raffles) he has to follow raffles and not go about doing anything else if then why cant farquhar help singapore after he was fired? I say again you do need to be in a certain position to be a founder as time, money, effort is all invested. You must know people who would help you."
  },
  {
    "id": "arg35698",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "lousy-father",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "Its better to have a lousy father then not have one at all. Even if you have a lousy father you can still learn from him. You can tell yourself, \"I'm not going to be like him, I'm going to be better\". Even if you have a lousy father his going to love you no matter what."
  },
  {
    "id": "arg33075",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "advancing-the-common-good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "While striving to make advancements for the common good you can change the world forever. <br/> Allot of people have succeded in doing so. Our founding fathers, Thomas Edison, George Washington, Martin Luther King jr, and many more. These people made huge advances for the common good and they are honored for it."
  },
  {
    "id": "794",
    "issue": "evolution-vs-creation",
    "stance_on_topic": "evolution",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "You can actually see evolution happen. Fruit Flies are quite useful for this experiment since the breed, live, and die so quickly. You have to understand evolution happens because of mutations and they survive because those mutations have made it easier for the creature to survive then the others. ie. natural selection. Speciation is also an example of evolution... different species come about because they have adapted to a slightly different enviroment. If you look you can see evolution"
  },
  {
    "id": "80854",
    "issue": "evolution-vs-creation",
    "stance_on_topic": "evolution",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "Science can prove that evolution is the beginning of life. <br/> The big bang theory is a term used to describe the bursting of molecules that begun the creation of the universe. The universe started out as a hot, dense space. Scientists know that because now nearby galaxies are moving further and further away and the universe is expanding and becoming cooler, so, in the past, the universe must have been hotter and more dense. Earth was the perfect candidate for life because it has the \"Goldilocks\" conditions. Bacteria started to form from molecules, which formed into fish, and then amphibians, then land animals, then monkeys, then humans."
  },
  {
    "id": "arg167721",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "no-it-is-raffles",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      2.0
    ],
    "text": "It was undoubtedly Raffles' ambition and vision which led him to search for another British base in the Straits of Malacca, and to select Singapore as the best location to achieve British economic and strategic objectives in the region. Without Raffles, it is likely that Singapore would have remained a sparsely inhabited island, on the margins of the Dutch colonial empire in the East Indies."
  },
  {
    "id": "2137504198",
    "issue": "is-porn-wrong",
    "stance_on_topic": "yes-porn-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      3.0,
      1.0,
      1.0
    ],
    "text": "This not only degrades morality, it also affects how women are treated in society today. This is against women empowerment in a sense that women are viewed merely as sex toys. Which at the end of the day affects how men perceive women which will in turn lead to a lot of disrespect and false perception. <br/> Now, how about crime rates? Murders, Rape, and Sexual Abuse. According to studies, all these people who committed these grave crimes all had one thing in common: PORN."
  },
  {
    "id": "arg168795",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "no-it-is-raffles",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      3.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      2.0
    ],
    "text": "Although Farquhar was said to be the one who stayed in Singapore to support its development, Raffles provided the planning, the strategizing, and was the one to select Singapore as another British base, giving early Singapore support of the British. If William Farquhar was to be proclaimed the founder because he did the \"grunt work\", shouldn't the supervisor of a construction site get the most commission, instead of the contractor? And besides, Raffles left Singapore under the orders of his superiors and he did not leave of free will"
  },
  {
    "id": "arg135637",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "books",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "TV is terrible. Except for Spongebob maybe. That's an alright show. Still, the majority of television is awful. So I'd have to say books based on that."
  },
  {
    "id": "arg202607",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Besides just a few people apply physical exercises in their life's!"
  },
  {
    "id": "arg126375",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "no-against",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      3.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      3.0,
      2.0
    ],
    "text": "well, India is finding difficult to manage itself first...so there's no question of leading the world so far....but still if we compare so lets have a look at the following points: <br/> 1. almost 90% of India is illiterate(don't be sure of the percentage), so an illiterate country can't lead the world.... <br/> 2.India is more into castes, politics, religions and less into development. <br/> 3.the most important thing is that India doesn't have confidence on itself and is still cursing itself... <br/> So if it goes on so then it is difficult or even impossible to say that \"INDIA WILL LEAD THE WORLD WHEN IT CANNOT LEAD ITSELF!!\""
  },
  {
    "id": "arg497712",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "books",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "books even reduce our electricity bills! which uses much of our spending money"
  },
  {
    "id": "arg399267",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "tv",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "If you can only understand or speak a specific language but you move to another country then most of the books are not in your language but TV comes in all different languages and you can also hear how the words are pronounced in a different language."
  },
  {
    "id": "arg644073",
    "issue": "christianity-or-atheism",
    "stance_on_topic": "christianity",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "Christianity does offer hope in the world. Christianity does tell others to help the poor."
  },
  {
    "id": "69016",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-choice",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Who are we to judge what is right or wrong? Can we not just let people make decisions and live with the consequences?"
  },
  {
    "id": "arg234411",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "In a school all the students may not belong to the same financial status . Some may be rich , some may not be that rich . So uniform provides equal status to all the students so that there is no gap among them . If there is no uniform , then the rich students will wear new dresses everyday which the other students cannot afford and may lead to resentment among them . <br/> Some insensitive children may also mock other students wear old cloths . <br/> So I beleive that uniform is essential especially in developing countries ."
  },
  {
    "id": "arg33341",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "If my spouse committed murder I would not turn him in. I would do the exact opposite I will help him hide all evidence if any, I will move if we had to, and I will never bring it up to his attention again. If my husband killed someone, he knew what he was doing, so there or it was for a cost. It would be hard for me to turn in the one I love."
  },
  {
    "id": "405",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "it-has-a-cute-logo-oh-and-extensions-err-add-ons",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "I find that whatever works for a person individually, is good. How would I be able to say something is the best, when, it doesn't work on someone elses computer? I vote for Firefox, because in my experience it has worked multiple times better than Internet Explorer. The config isn't too bad, and those of you who know about:config know what I'm talking about. The tabs are great, and has many good extensions. Though not the best, it is definately superior to Internet Explorer. Especially after the laughable 7 update. ;D"
  },
  {
    "id": "arg335097",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "In my opinion, I strongly agree that parents should use spanking as an option to discipline their children because the spankings are painful enough for children to learn to avoid doing the wrong things."
  },
  {
    "id": "arg35584",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "lousy-father",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      3.0,
      2.0
    ],
    "text": "It's better to have a father than to not have one. For example, me. I grew up without a father and if I had a choice of being a billionaire or to have a father growing up, I'd choose to have a father. I'm basically a bastard legally because he isn't even on my birth certificate. No one should grow up without a father because honestly, it messes with them. Kids in school will ask about your dad and you have nothing to say. Whether he is lousy or not, a child should always be in touch with their dad. Even if he isn't with the mother anymore."
  },
  {
    "id": "arg219293",
    "issue": "ban-plastic-water-bottles",
    "stance_on_topic": "no-bad-for-the-economy",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "Most Americans on average recycle 86-88% of there bottle waters. That is more than half! So stop complaining that we dont recycle because we do! <br/> http://www.treehugger.com/culture/23-percent-of-americans-donatmt-recycle.html"
  },
  {
    "id": "12402",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "From a religious standpoint gay marriage isn't even possible. Let along right. But everyone isn't religious or adheres to specific religious guidance. <br/> Marriage is defined as between a woman and a man. So the word \"marriage\" may be misused in this case. Civil unions, well that's a different matter."
  },
  {
    "id": "65125",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "there-s-more-browsers-than-the-ie-firefox-is-an-animal",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Chorme beats all its the fastest and the safest plus its also open source like firefox"
  },
  {
    "id": "12466",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "gays are overrated. it is another \"look at me\" stunt. i think gays are the product of overly protective parents, abuse, or liberal wakoness (it should be a disease). <br/> if you gays would stop calling attention to yourselves, nobody would really care what you do."
  },
  {
    "id": "79734",
    "issue": "is-porn-wrong",
    "stance_on_topic": "yes-porn-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "jarman: <br/> porn is wrong because it sholud be in 4-D with surround sound and special effects :) it would make it much more pleasurable btw im a girl........"
  },
  {
    "id": "12367",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "there-s-more-browsers-than-the-ie-firefox-is-an-animal",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "Firefox (and the extensions) leaks memory like a sieve. An opened session of Firefox 2.0.0.1, three tabs, one week, uses 250  Meg of memory under Task Manager on Windows."
  },
  {
    "id": "arg213068",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "How are we supposed to curb childhood obesity if we don't start at a young age?"
  },
  {
    "id": "817",
    "issue": "evolution-vs-creation",
    "stance_on_topic": "evolution",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "Radiometric dating can be done in many ways. Today there are over 40 different techniques to do it. It is the fact they are independent, observable, and falsifiable that makes it scientific rigor. I would recommend going tohttp://www.asa3.org/aSA/resources/Wiens.html for more information on radiometric dating."
  },
  {
    "id": "arg168774",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "yes-of-course",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      2.0
    ],
    "text": "Farquhar was the one to implement the actual operations, whereas Raffles only came up with the ideas, which would or would not work. Actions require action, and Farquhar implemented those ideas."
  },
  {
    "id": "arg168790",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "no-it-is-raffles",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "He revived the cultural heritage of the region by setting up schools for the Chinese and Malays and did a lot for the people while Farquhar just wanted to gain control through his actions."
  },
  {
    "id": "arg219206",
    "issue": "ban-plastic-water-bottles",
    "stance_on_topic": "no-bad-for-the-economy",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      3.0,
      3.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      3.0
    ],
    "text": "Americans spend billions on bottled water every year. Banning their sale would greatly hurt an already struggling economy. In addition to the actual sale of water bottles, the plastics that they are made out of, and the advertising on both the bottles and packaging are also big business. In addition to this, compostable waters bottle are also coming onto the market, these can be used instead of plastics to eliminate that detriment. Moreover, bottled water not only has a cleaner safety record than municipal water, but it easier to trace when a potential health risk does occur. <br/> (http://www.friendsjournal.org/bottled-water) (http://www.cdc.gov/healthywater/drinking/bottled/)"
  },
  {
    "id": "arg33270",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "No. I couldn't imagine turning on my spouse like that. I know if i were to do something like that she will be right there next to me not saying a word. Plus if she were to kill someone it would be for a good reason."
  },
  {
    "id": "arg33285",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "No I wouldn't turn in my spouse. Just because the girl that i married killed someone doesn't make them a terrible person. People make mistakes."
  },
  {
    "id": "arg219227",
    "issue": "ban-plastic-water-bottles",
    "stance_on_topic": "yes-emergencies-only",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "In New York City alone, the transportation of bottled water from western Europe released an estimated 3,800 tons of global warming pollution into the atmosphere. In California, 18 million gallons of bottled water were shipped in from Fiji in 2006, producing about 2,500 tons of global warming pollution."
  },
  {
    "id": "12388",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "there-s-more-browsers-than-the-ie-firefox-is-an-animal",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      1.0,
      2.0
    ],
    "text": "IE7 on Vista supports protected mode which runs the browser in a security context that has minimal access to your computer and private information. Both Firefox and IE are internet facing apps with occasional security issues, so I prefer the browser with better security architecture."
  },
  {
    "id": "arg623493",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "yes-for",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "I am an American, and I am ashamed to admit \"Merica is rich due to slavery. India never had slavery and used to be rich until the British came and took everything away. We were left in a bad state, but started developing quickly. India is much more competitive in education than America and soon when everyone has education (which will happen in our lifetime) India will excel. <br/> India has the potential."
  },
  {
    "id": "arg203922",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "yes, i believe it's nice to have a school uniform. Each school 's uniform signifies its goal for instant i wore white shirt and blue skirt in my school days, white color is an indication of peace and blue of fidelity in relationships moreover identical uniform also removes the wall of status. it also depicts that whether a child comes from high or low class they all are treated equally under one roof ."
  },
  {
    "id": "12592",
    "issue": "evolution-vs-creation",
    "stance_on_topic": "creation",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "I can prove to you that humans have not evolved since the beginning of recorded history"
  },
  {
    "id": "arg525686",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "tv",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "tv is better than book dathu ihfej tijkjdrk xtklp09 guil09 sfjiiytg dh,lut457 p[];o;l"
  },
  {
    "id": "arg168818",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "yes-of-course",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "To me, a founder would be a leader, well respected by the organisation/group he is managing. Both Raffles and Farquhar were good leaders. However, when William Farquhar was sent off to Britain, more people went to send him off than the combined number of people that sent Raffles off during the three times Raffles left Singapore. This shows that the people of Singapore respected Farquhar more than Raffles, and to them, Farquhar was a more competent leader."
  },
  {
    "id": "arg110967",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      2.0
    ],
    "text": "phy. ed is just another class. students should start to be responsible for their actions by the time they are in highschool. if they are responsible with a car, then they should be responsible with their health. the tax payers also dont realize that they are paying for students to go swimming or play the whole hour."
  },
  {
    "id": "1633",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-choice",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "If a woman is raped and left with the bastard child of the man who raped her and severely emotionally traumatized her, she should have the decision to give up that baby. Certain circumstances call for desperate decisions and this is one, the choice should be her's to make and she should be allowed to make it."
  },
  {
    "id": "69708",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Of course its wrong. <br/> Why do you think Aids exists?"
  },
  {
    "id": "arg219259",
    "issue": "ban-plastic-water-bottles",
    "stance_on_topic": "no-bad-for-the-economy",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "Bottled water is somewhat less likely to be found in developing countries, where public water is least safe to drink. Many government programs regularly disperse bottled water for various reasons. Distributing small bottles of water is much easier than distributing large bulk storages of water. Also contamination from large water storage containers is much more likely than from single 12-20 ounce bottles of water."
  },
  {
    "id": "arg35700",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "lousy-father",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      3.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      2.0
    ],
    "text": "I would have to choose a lousy father. I think having a father figure around even though he might not do much for you or the family is better than none. A father to me plays a huge role in a childs life he keeps thing stable throughout your childhood. My father is pretty lousy but he does support me and helps out sometimes I would rather have a father than none."
  },
  {
    "id": "458",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "it-has-a-cute-logo-oh-and-extensions-err-add-ons",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "Mozilla Firefox can be used for everything! There are also plugins so that you can use the internet explorer engine in the firefox shell. It has many more plugins and the themes are a nice feature. all of the innovations in E 7.0 were in firefox years ago."
  },
  {
    "id": "arg35619",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "lousy-father",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      2.0
    ],
    "text": "There is scientific evidence that shows having a mother and a father is the healthiest way for a child to progress physically and mentally. <br/> So a lousy father is better than none.(that is of course assuming that he is not abusive in any way) <br/> Also, people change. Who says that he will be lousy forever. There are family therapy sessions you can attend to help."
  },
  {
    "id": "arg7751",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      2.0
    ],
    "text": "It should be mandatory because being active and getting involved in sports, even through PE, helps children develop good habits later on in life. Plus, there's the benefit of working together as a team that doesn't always happen in other classes."
  },
  {
    "id": "1191878965",
    "issue": "is-porn-wrong",
    "stance_on_topic": "yes-porn-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "hells yeah porn is wrong. i mean wtf. film naked girls to publicly distribute it on the internet so jerk off's can jack off to them. porn is only here because it makes so much money and stupid people are buying into it. if it's not wrong then try watching it in front of your family, friends or the younger youth. yeah you would feel uncomfortable and you know why? because of common f**king sense and our conscience deep inside we know it's wrong."
  },
  {
    "id": "arg35615",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "lousy-father",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "Even though your father might not be the best or always there for you he is still your father. Every father has a certain connection with there children and thats what shapes and molds a son or daughters character and personality. I believe our parents play a major role in determining who we are even if they are lousy they are still our kin."
  },
  {
    "id": "54763",
    "issue": "is-porn-wrong",
    "stance_on_topic": "no-is-is-not",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Porn isn't inherently wrong because It really can't substantially harm anyone who isn't involved in it by choice.It really is just as simple as that."
  },
  {
    "id": "28498",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-choice",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "The only other choices are, adoption or keep it. <br/> And I know many children get adopted but many don't <br/> and it might be better off to just have an abortion to <br/> let them suffer. <br/> That's the chance they take, I guess. But who are we to <br/> decide one womans pregnancy."
  },
  {
    "id": "arg168779",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "yes-of-course",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Farquhar was unjustly exiled by Raffles even though William had done a lot to help Singapore."
  },
  {
    "id": "arg33141",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "advancing-the-common-good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "I believe its best advancing towards the common good, but it doesn't really exist in this world. Mostly everyone is greedy, selfish, only would care about what they want, and not caring about what others would want. I believe everyone have small feeling towards the common good, but most people think they are important than anyone else in the whole world."
  },
  {
    "id": "arg118660",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "no-against",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "India has the potential to lead because it has the second largest man power n third largest army in the world n it is a country full of hopes n aspirations n for Indians nothing is impossible, n we r proud to be Indians n we will lead the world n be the king of the world in every manner. even 34% scientists in NASA are Indians."
  },
  {
    "id": "39342",
    "issue": "is-porn-wrong",
    "stance_on_topic": "yes-porn-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "The argument that porn would expose one to the reality in life, and thus increasing one's maturity and prevent possible future sexual assaults, is totally crap. <br/> porn is definitely wrong. after a dosage, the guilt of wasting ur time, wasting energy, wasting effort and not devoting urself to another thing and regretting that you should not have started would almost kill you. trust me. <br/> its a road that shld not be taken, its as bad as smoking and dugs. i think the only reason its not banned in most developed countries is that they are facing an aging population."
  },
  {
    "id": "arg54267",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      3.0,
      1.0,
      1.0
    ],
    "text": "Physical education does absolutely nothing for the children's health and/or lifestyle. Let me describe my PE experience. <br/> Throughout my public education career, PE has been mandatory for each year. This has involved barely moving, standing talking with friends, half-hearted volleyball/dodgeball, yearly physical fitness tests that don't require effort, DDR, bouncing on fitness balls, and, most recently at my arts high school, watching sports documentaries and playing Wii Sports. <br/> Unless public education is reformed, health classes can teach children what they need to know about fitness and nutrition, because PE classes are severely lacking."
  },
  {
    "id": "arg238471",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "bad",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      3.0,
      3.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "I take the view that, school uniform is very comfortable. Because there is the gap between the rich and poor, school uniform is efficient in many ways. If they wore to plain clothes every day, they concerned about clothes by brand and quantity of clothes. Every teenager is sensible so the poor students can feel inferior. Although school uniform is very expensive , it is cheap better than plain clothes. Also they feel sense of kinship and sense of belonging. In my case, school uniform is convenient. I don't have to worry about my clothes during my student days."
  },
  {
    "id": "800",
    "issue": "evolution-vs-creation",
    "stance_on_topic": "evolution",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      3.0,
      3.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "Peppered moths is the ULTIMATE straw man. <br/> The peppered moths experiment was a bad experiment and did not show evolution. That how ever doesn't mean that other experiments/observations don't show evolution. <br/> There is loads of evidence to support evolution. <br/> Genes <br/> Fossil record <br/> Carbon dating <br/> Geological data <br/> VIRUS studies <br/> Ohh yeah, viruses. <br/> Do you know how strains of viruses become immune to anti biotic? They evolve, and because viruses reproduce very quickly they evolve over a shorter time period and can be observed by humans. <br/> Your flu injections are made using evolution science."
  },
  {
    "id": "46238",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-right",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      3.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      3.0,
      1.0
    ],
    "text": "Gay marriage bans, along with other laws, are only in place because of the religious right that seems to be infecting this country. The UNITED States of America can only remain united if laws are created with all men and women in mind. To have a law that favors one religion, or lack thereof, over another is the bane of freedom. Secular law is the only law that works. <br/> Leviticus 20:13: \"If a man lies with mankind as he does with womankind, they are both commiting an abomination, they shall be put to death, their blood is on their own hands.\" <br/> There's a loving god, eh?"
  },
  {
    "id": "arg336277",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "bad",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "the kids lose their individuality and it doesn't feel comfortable"
  },
  {
    "id": "arg33118",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "personal-pursuit",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "I believe personal pursuit its better, because its your job to decide what you want to do with your life. Your not always going to have someone by your side telling you whats right or wrong. Its all on you of reaching their goals. Its also a good thing to help other reach their succeed their goals."
  },
  {
    "id": "arg485419",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Sport should not be compulsaryy!!!!!!!!!!!!!!! <br/> So man kids get bullied in pe because they are fatter then others or more unfit! Bullies pick there victims each day in pe so all u guys on the affirmative team are WRONG!"
  },
  {
    "id": "arg168824",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "no-it-is-raffles",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      3.0,
      3.0
    ],
    "effectiveness_scores": [
      3.0,
      3.0,
      2.0
    ],
    "text": "Raffles was the person who signed a treaty with the Temenggong and also the Sultan Hussien, and not William Farquhar. I agree that William Farquhar was the one that remained in Singapore to keep it running and also developed it further, but Raffles was the one who gave him the position because he had to leave and return to Bencoolen, also, he was the one who laid out the foundation of Singapore's Development, so he should be considered a founder."
  },
  {
    "id": "arg335564",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      3.0,
      3.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "Nope. I believe it shouldnt be done just to discipline a child. Parents could just scold their child just so they would stop what they are doing wrong. Hitting is not really a solution because aside hurting a child emotionally, it also hurts them physically. Kids wouldnt learn the value of respect for their parents because they would only learn how to be scared. They wont do the wrong action again next time, not because they've learned their lesson, but because they are just scared that their parents would hit them"
  },
  {
    "id": "arg122478",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "no-against",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      2.0
    ],
    "text": "i think, the india is not ready to lead the world because of many reasons.. <br/> 1.) the politians of our country are involved in black money cases. they try to gain or earn money as possible. <br/> 2.) they always try to make a big issue of useless topics. e.g., if a politian says something about another politian, they try to make it a big issue ."
  },
  {
    "id": "arg336179",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "No because hitting your child could mentally scar them for life. also it can make them think hitting their kids is alright."
  },
  {
    "id": "arg33135",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "advancing-the-common-good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "I think common good is better than personal pursuit because it's always better to assist other people. When people help each other out its more likely that everything comes out great. You get to become a role model by helping some one that needs your help. Yes personal pursuit is important when you are thinking of going to college. But than you got to think about leaving legacy behind by teaching other what you know. So the learning or society process can advance. So therefore you let others take it to the next level."
  },
  {
    "id": "arg200133",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "school uniform does no harm to students life emotions now as for the point of expressing oneself imagine one bully wearing shirt,tie,pant all neatly ironed and well polished shoes wont he look good.remember dressing sense also is a part of ur interveiw"
  },
  {
    "id": "arg317750",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "books",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "I thick that book are better than TV is it is better i can put you in a whole norther wold and it is educational"
  },
  {
    "id": "arg336563",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "Yes because that way the child can learn not to do it again because it really hurt, and i know this from experience."
  },
  {
    "id": "arg33293",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "i would turn in my wife because its wrong to kill someone. it could have been an accident but it was still wrong and besides the police are going to find out who killed that person but i don't want her to leave me for a long period of time so i would tell but then again i wouldn't."
  },
  {
    "id": "arg219250",
    "issue": "ban-plastic-water-bottles",
    "stance_on_topic": "no-bad-for-the-economy",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      2.0
    ],
    "text": "it is true that bottled water is a waste, but bottles can be reused!"
  },
  {
    "id": "arg35720",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "lousy-father",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "I think is better to have a lousy Father than to be Fatherless, maybe having one is not that bad, other than living with the idea you didn't had one or with the doubt of how could it be to have one."
  },
  {
    "id": "arg240625",
    "issue": "christianity-or-atheism",
    "stance_on_topic": "atheism",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "christians are also fun to lawl at because they waste half of their sunday going to church. What a waste!!!! HAHAHA"
  },
  {
    "id": "arg213555",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "books",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "Books enlighten the soul. Books don't destroy the morals of children. Books throw the mind into a series of questions, they take the readers to mystical places, paradise, and even the kitchen sink. They change your perspective on life and often give the reader a sense of relativity. Television is like a drug. It's as bad as nicotine. Fahrenheit 451, the Night Circus, The Secret Garden, Inkheart... Do I have to further explain..?"
  },
  {
    "id": "arg240623",
    "issue": "christianity-or-atheism",
    "stance_on_topic": "atheism",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "there is no god. Science has proven it. It was just an excuse made up so people from simplier times didnt have to think to hard on those big questions."
  },
  {
    "id": "1641",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-choice",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "Surely if we are worried about the feelings of unborn children within the first few months of pregnancy, than we should first be worried about protecting the rights of far more conscious animals, such as fully-developed primates. <br/> If its isn't their feelings we are worried about, then I guess I am very confused about the pro-life point of view."
  },
  {
    "id": "arg35635",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "lousy-father",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "I believe it is better to have a lousy father than to have none. It is important to have a role model to look up to and without that figure, you might become lost in the world. A lousy father is not that bad because what exactly makes a lousy father, always working and not having time for you. A father that isn't always around is no reason to prefer to have no father. Growing up and seeing the way your father is, makes you want to become like him or gives you the motivation to surpass him and become even better than he is."
  },
  {
    "id": "arg159445",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "books",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      3.0
    ],
    "effectiveness_scores": [
      3.0,
      1.0,
      2.0
    ],
    "text": "Books offer improvement with grammar and spelling skills. Plus it's more creative. With TV everything is done for you. With books you can imagine the characters looks and the setting with your own little creativity in it. <br/> Plus you can take books anywhere and everywhere without disrupting anyone."
  },
  {
    "id": "arg54258",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      3.0
    ],
    "effectiveness_scores": [
      3.0,
      3.0,
      2.0
    ],
    "text": "PE should be compulsory because it keeps us constantly fit and healthy. If you really dislike sports, then you can quit it when you're an adult. But when you're a kid, the best thing for you to do is study, play and exercise. If you prefer to be lazy and lie on the couch all day then you are most likely to get sick and unfit. Besides, PE helps kids be better at teamwork."
  },
  {
    "id": "arg168804",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "yes-of-course",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Faquhar solved the problems in Singapore using cash from his own pocket. When Singapore was once infested with rats and centipedes, Farquhar rewarded the people with coins for every pest they catch. This solved the problem quickly, as he held to his promise."
  },
  {
    "id": "arg35676",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "lousy-father",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "I wouldn't live my life right if I never got to meet my father. I wouldn't care if I grew up and had lousy father even if he has no job or life and maybe even an alcohlic. Having a father means alot especially if your boy because most fathers are friends to, so you can talk to them about guy problems and they would understand the situation and with just living with your mother you couldn't because she's a woman and her views are different then a guy. Whether its a good or lousy father they will always be there for you at sometime in life."
  },
  {
    "id": "arg108968",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "no-against",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "When the U.S. fought the Brits for their independence, the Brits wore a red uniform. Every time the Americans saw a British soldier, they would yell, \"The red coats are coming, the red coats are coming.\" <br/> If India ever tried to take over the U.S., Americans would be forced to yell, \"The red dots are coming, the red dots are coming.\" ;)"
  },
  {
    "id": "arg479199",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "tv",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "TV is better than books because the educational programs on TV are much more convenient and easy to understand. It is also easy to use for people who cannot see or hear. Books are also likely to be not updated with latest information about a certain topic while information from TV can be much more accurate and useful."
  },
  {
    "id": "arg123380",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "yes-for",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "India is a secular state.people of all communities reside here so india has the knowledge of almost all countries and the way they live. so it can easily lead all the people of world without creating any nuissance among anyone."
  },
  {
    "id": "arg106426",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "yes-for",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Do we have the potential? <br/> Yes. <br/> The only competition we have is China who has done a much better job for the long run. <br/> But then again the way India runs.. it always makes order out of chaos."
  },
  {
    "id": "arg334934",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "A parent shouldn't use spanking as an option to discipline a child because they might grow up traumatized and they might feel unloved since they would get spanked a lot, that will cause a low self of esteem. Also spanking shouldn't be an option because at that moment the parent would be full with anger and they wouldn't be thinking logically."
  },
  {
    "id": "arg135648",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "books",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "One Flew over the Cuckoos Nest, East of Eden, Nabokov's Lolita, 1984, Martian Chronicles - I could go on and on. For real. There's very little that beats the world described in books."
  },
  {
    "id": "477",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "it-has-a-cute-logo-oh-and-extensions-err-add-ons",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "From a design standpoint, Firefox absolutely wins the Pretty Browser battle. <br/> There is such an array of beautiful skins out there for Firefox, and when you add that to the amount of Toolbar and UI customization that Firefox supports, the 'Fox is the clear-cut winner. <br/> And since I assume most of the people debating the superiority of one browser or another are Intraweb junkies, I know everyone uses their browser quite often. <br/> Who wants to look at an ugly UI like that of every IE (7 is the most criminal of them all)?"
  },
  {
    "id": "arg33127",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "personal-pursuit",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      2.0
    ],
    "text": "I think that personal pursuit is more important because in order to help others you have to help yourself first. At the time it may seem selfish but once that you get to a point that you are good at what your doing then you can help others do the same. So not only are you helping yourself but you are also helping others."
  },
  {
    "id": "arg219220",
    "issue": "ban-plastic-water-bottles",
    "stance_on_topic": "yes-emergencies-only",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      1.0
    ],
    "text": "The growth in bottled water production has increased water extraction in areas near bottling plants, leading to water shortages that affect nearby consumers and farmers. In addition to the millions of gallons of water used in the plastic-making process, two gallons of water are wasted in the purification process for every gallon that goes into the bottles."
  },
  {
    "id": "arg33089",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "advancing-the-common-good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "The ability to do both would be awesome, but since I have to choose I'd rather help others in any way I can. Even a little thing can impact someone's life, like being a friend or helping them with getting their needs to survive life."
  },
  {
    "id": "arg168803",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "no-it-is-raffles",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "Raffles conceived a town plan to remodel Singapore into a modern city. The plan consisted of separate areas for different ethnic groups and provision of other facilities such as roads, schools and lands for government buildings. In October 1822, a Town Plan Committee was formed by Raffles to oversee the project."
  },
  {
    "id": "arg33086",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "personal-pursuit",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "A personal pursuit is a better endeavor because you are fulfilling something within yourself. It is important to help others but there is a time to do so. Achieving a personal goal is a journey to fulfillment where one is truly happy. Before helping others you must remember about yourself, but you must not forget about those who are really in need."
  },
  {
    "id": "arg168780",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "yes-of-course",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "Faruhar carried out the 'grand plan' of Raffles'. Raffles practically just sat there and watched it all go, not even lifting a finger to help. It doesn't matter if Raffles was the head of the so-called operation, Farquhar was the one to DEVELOP Singapore to what it is today."
  },
  {
    "id": "1683",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-choice",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "In the United States of America, pro-choice is the only constitutional way to go. Elsewhere in the world, people will do whatever they want."
  },
  {
    "id": "67160",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-right",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Just beacuse there gay does not mean that they dont have a right to be happy! how would u feel if you were denied! we live in the 21st centry! everyone else is allowed to get married so why should not they!"
  },
  {
    "id": "12371",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "there-s-more-browsers-than-the-ie-firefox-is-an-animal",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "I was a IE user from the beginning, but recently I started using Firefox. Apart from the obvious differences like availability of tabs in Firefox which was not avaible in IE I don't find any other significant advantages in using firefox. Also now IE7 has got the tabs feature included, along with add-ons to provide different functionalities. <br/> So I think IE is better than firefox."
  },
  {
    "id": "arg33082",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "advancing-the-common-good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Both endeavors are better to be part of.But I as an individual I would like to advance the common good in this society to become unpetty with each other,to do things way better than they use to.Everyone in this world knows what they want to be. To be alone pursuing their dreams without the help of others, but some other will help the community to make it safe and better.To teach them what they are capable of,to beleive in themselfs that they can do as the things wealthy people does."
  },
  {
    "id": "arg271353",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      3.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      2.0
    ],
    "text": "OK no and yes I think p.e should be education which is teaching students how to eat right and live a healthy life style not making a fat kid run 10 laps around a track but showing them that eating right and exercise can BE FUN not having an obese child being bully because they can't run as fast as someone else. That is what physical education could be real EDUCATION. Students should not feel bad if they can't run a 5k or do 20 push ups"
  },
  {
    "id": "arg107445",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "i think that PE clases should be obligatory in school to help the problem of obecity."
  },
  {
    "id": "arg132199",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "no-against",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "according to a recent report 50% scientists in NASA are indian IITians, just imagine that if those scientists will join ISRO then our status,value and astronomical knowledge of india will definetly increase. <br/> Now,think abt. IITians,students who are qualifying iit, they are known to be superbrain.If India is capable of opening hitech institutions,then why we are unable provide them a perfect job of their level.we are giving international status of education.then why unable to take best advantages from them.this is due to brain drain,lack of industrial development,suitable working environment as well as proper salary.so its the need of the hour to improve our industrial sector."
  },
  {
    "id": "37675",
    "issue": "is-porn-wrong",
    "stance_on_topic": "no-is-is-not",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      3.0,
      3.0
    ],
    "effectiveness_scores": [
      2.0,
      3.0,
      2.0
    ],
    "text": "Porn is entertainment. Is it wrong and evil to have swear words in songs, because some people don't like it? Of course not. Should sex scenes in movies or TV shows be illegal? Nope. If you do not like porn, don't watch it. If you like it, it is your right to watch it."
  },
  {
    "id": "arg312577",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "P.E. should be optional in 8th grade. If students want to participate, then so be it. However, in 8th grade students have a lot going on. That time may be used more beneficially by studying."
  },
  {
    "id": "arg260899",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "Yes. Physical education, if taught and encouraged properly and approached with the right attitude, will be rewarding for both student and teacher."
  },
  {
    "id": "arg35726",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "lousy-father",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      3.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "It would be better to have a lousy father than to not a have a father at all. If you were to grow up with out a father you would always have that empty void feeling about it. And if your father is lousy it helps you strive to be better than him. It could also cause you to start being responsible faster because the father isn't taking care of business. Like me and my brother, my father is lousy but I'm still happy i know who he is. Just because i cant imagine wondering about it."
  },
  {
    "id": "arg33123",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "personal-pursuit",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "In order to help advance a common good, you must first realize what is your common good. You have to know when you are that better person to then spread your good to other people. You can't just assume that you are a great person if you don't have anything to show it. If you desire to see a world full of all this goodness, YOU have to be that spark that starts the fire."
  },
  {
    "id": "arg200706",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "bad",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "We talk about how schools destroy creativity and uniforms are a classic example of that destruction. In most schools with uniforms the students are given the occasional day to were their casual clothes but are then given strict guidelines as to what is acceptable. This is effectively turning \"casual clothes\" into a twisted \"causal\" uniform."
  },
  {
    "id": "arg334924",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "because depending on the punishment you give a child it doesn't always work, some kids need need that. because just sitting them in punishment its a possibility they will do it again."
  },
  {
    "id": "arg561428",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "tv",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      2.0
    ],
    "text": "TV ,,!! because you can get information from different resources in a short time ,,, but Books you must read a lot to get that much of information !!"
  },
  {
    "id": "arg335091",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "Parents shouldn't use spanking as an option to discipline it just makes the child get mad than to see what they did wrong."
  },
  {
    "id": "12431",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "I did not propose \"separate but equal.\" I proposed \"distinct and different.\" Man/woman relationships, especially in the aggregate, have a very different set of implications than man/man and woman/woman relationships. If the law is to contemplate man/woman relationships intelligently, it has to be able to isolate them. <br/> A law requiring separate schools and public accomodations for homosexual people would violate \"separate but equal.\" Law defining marriage as a man/woman relationship does not."
  },
  {
    "id": "arg35591",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "fatherless",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "In my opinion, I believe it is better to be fatherless then to have a lousy father. I wouldnt know how it feel to have a lousy father but I have friends that there fathers are always drunk and never do anything to help them. They sometimes tell me they wish there dad wasn't around. Now if my dad was like that I would think the same because at least by not having a father you wouldnt know how it feels to be dissapointed by a father."
  },
  {
    "id": "arg35705",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "fatherless",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "I think in any case its better to have no father then to have a lousy father either way you still lose. When you have a father you want him to be the best he can be so you can learn from him as you grow up. If you were to have a lousy father then whats the point of having a father at all if he's just going to be lousy and he wouldn't teach you anything. It's always better to have a respectable father figure in your life then to have a lousy father figure."
  },
  {
    "id": "27868",
    "issue": "is-porn-wrong",
    "stance_on_topic": "yes-porn-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "in the past, children could walk around as they pleased, to and from the candy store, to and from school. now there are child pornographors, sexual predators online. porn has opened the doors to new crimes."
  },
  {
    "id": "arg126378",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "yes-for",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      3.0,
      3.0
    ],
    "effectiveness_scores": [
      2.0,
      3.0,
      2.0
    ],
    "text": "The Indian economy is galloping at a breakneck speed and might even reach double-digit growth by 2013, feel Finance Minister Pranab Mukherjee and Commerce Minister Anand Sharma. Many economists agree that the demographic dividend that India enjoys could see the country sustain its high growth rate for a long time to come. <br/> The India growth story is indeed enviable. Despite being plagued by myriad problems, India has emerged stronger and more resilient to any global crises so far. <br/> India is expected to be the world's fastest growing economy by 2018, according to Economist Intelligence Unit, a research arm of the Economist magazine."
  },
  {
    "id": "arg470033",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "tv",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      2.0
    ],
    "text": "I think T.V. is more helpful as the you can watch and listen to something being explained like if we read about budding or spore formation we have to create an image about that in mind, but when we watch the animation of budding then we could understand better. Some people can't even imagine so T.V. is helpful. As concerning the time limit or harm to our eyes, we should watch T.V. in a limit, because the excess of everything is harmful, even reading of books. <br/> Surveys have found that a normal person can remember 10% of what he had read and 50% of what he had listened and watched."
  },
  {
    "id": "arg561672",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      2.0
    ],
    "text": "1. It makes everyone equal - if children can wear what they want some children will teased and feel less equal to their peers around them vs. uniforms <br/> 2. Okay Look school is for learning not how you look and dress but maybe in some levels it matters and most people that go to schools that don't have uniforms take like about 1 hr just to find their pants or shirt I mean really?? When you have a uniform it takes less than 10 min just to take it out and put it on and"
  },
  {
    "id": "arg335089",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "yes because if they fear getting hit than they wont do it again"
  },
  {
    "id": "arg231770",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "bad",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "i thik thier bad because i think ushould be free with out nobody telling u wat to do"
  },
  {
    "id": "arg542561",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "THE SCHOOL UNIFORM IS A VERY GOOOOOOOOOD IDEA , WHY ?? <br/> becouse the school uniform makes pupils concentrated on their education than on their clothes and I believe that school uniform instills discipline among pupils it makes pupils with diferent material statuses more equal :)"
  },
  {
    "id": "arg334943",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "No because spanking might effects the relationship between the child and parents. And Children can pick up on the parents attitude acting violent. There are better ways to solve problems, for example using the other techniques."
  },
  {
    "id": "arg212151",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "If you want your kids to wear uniforms, go to a school that allows that. But don't go crying to me that your kids are underachieving, easily-distracted, derelicts that can't focus their attention for 5 minutes in class. <br/> Maybe I'm exaggerating. <br/> But my message is clear. Uniforms are here to prevent problems that not wearing uniforms would cause."
  },
  {
    "id": "arg33272",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      3.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      3.0,
      1.0
    ],
    "text": "If my spouse committed murder I would have to turn them in, because I don't think I could go on with life knowing that they've murdered someone. The relationship wouldn't be the same it would change because now you view the person as somebody else, you don't see them as your spouse any more, you just see them as a bad person, and they could be crazy enough to do something to you."
  },
  {
    "id": "arg334884",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "I believe so, it should be used as a last resort at least because I being a sibling of three, was spanked along with my sister and turned out to be disciplined and on the other hand our youngest sister has never been spanked and she tends to make more mistakes even now that shes 10 than we did."
  },
  {
    "id": "arg219225",
    "issue": "ban-plastic-water-bottles",
    "stance_on_topic": "no-bad-for-the-economy",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      3.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "Banning plastic bottled water would be a huge mistake in this very moment. More than a million people in the United States purchase bottled water every day which is helping the economy com out of this recession we are in. maybe not in a big way but every kid of help counts! Bottled water also only makes less then 1&#xof; the worlds wastes and can be recycled! According to the National Association for PET Container resources, PET water bottles are no the most recycled container in curb side programs by weight and by number! <br/> http://www.nestlewaterscorporate.com/bottled_water_things_to_know/Video/index.html?@videoList.featured=31101711001"
  },
  {
    "id": "arg585674",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "tv",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "A picture is worth a thousand words. TV lets you see and hear a story, or information. Imagine just reading about the recent disasters in Japan, Alabama and Missouri vs. seeing them and seeing interviews with survivors. Much more powerful and immediate on TV. <br/> Books take too much time. TV gives the info much faster."
  },
  {
    "id": "arg580842",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "no-it-is-raffles",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Raffles had a vision for Singapore that it will be an orderly, elegant, rational and modern and he worked towards it. And while Raffles was gone, Farquhar developed Singapore poorly causing Raffles to feel dissappointed."
  },
  {
    "id": "arg106091",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "yes-for",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      2.0
    ],
    "text": "I believe that India is fast emerging as a hub for international trade and investment. India has provided a huge opportunity to enhance trade and investments in sectors such as mechanical and electrical engineering, food processing, automotive, tourism and banking among others. Almost every multinational company is focusing on India."
  },
  {
    "id": "14003",
    "issue": "is-porn-wrong",
    "stance_on_topic": "no-is-is-not",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "Easy access to porn may be the reason there has been an 85 percent decline in rapes over the last 25 years, according to a law professor at Northwestern University."
  },
  {
    "id": "arg35650",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "lousy-father",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "I think that it will be better to have an lousy father than no father. A least you have an father. You know who he is and where he is. You will also kinda get an idea on what you going to be when you go up. If he is an lousy father, that will help you not be what he is. You can say that it is motivation that will help you became an better father. Because you don't want to be like your father. You want to better that your father, in-fact that should motivate you to be the greatest father you can be."
  },
  {
    "id": "arg168771",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "no-it-is-raffles",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "The Singapore Treaty is signed between Raffles,Sultan Hussein and the Temenggong with Commandant under the accompanying seven ships witnessing the event."
  },
  {
    "id": "arg334959",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "yea, because even though there are many other different ways to discipline kids, sometimes it won't work so they need a little spank, just to make them learn they were wrong. don't always be spanking them for no reason, that's bad"
  },
  {
    "id": "arg219258",
    "issue": "ban-plastic-water-bottles",
    "stance_on_topic": "no-bad-for-the-economy",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      3.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "Banning bottled water would hurt the economy because it would leave hundreds of people without jobs and the big corporations like Dasani and Nestle would loose millions of dollars. It would hurt the economy severely. Millions of Americans use and purchase water bottle everyday so, banning them would only hurt big corporations. <br/> http://www.nestlewaterscorporate.com/bottled_water_things_to_know/"
  },
  {
    "id": "arg660921",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "yas,of course . School uniform is important <br/> 1.school uniform is a logos for our school <br/> 2.to remind us that we are part of the school <br/> 3.and if we use the uniform basically student used to think what are they gonna do to, is it positive or negative <br/> 4.in the morning we should use our uniform and if were not use our uniform the teacher give us a punishment and from that we can learn to be a discipline student <br/> 5.if we go out from the school than the teacher will see we used the school uniform so people will know that we from that school <br/> thankyou"
  },
  {
    "id": "13260",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-life",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      3.0,
      1.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      1.0
    ],
    "text": "There are tons of ways to not get pregnant. There are condoms (99% effective) for men and women, there are morning-after pills (75% effective), the patch, pill, and other forms of ways not to get pregnant. It's the woman's fault that she didn't do it. <br/> And maybe instead of Pro-choice vs. Pro-life, they (i don't know who \"they\" is) should have pro-life, but with exceptions (i.e. women that get raped) so that it's fair all-around."
  },
  {
    "id": "arg219244",
    "issue": "ban-plastic-water-bottles",
    "stance_on_topic": "no-bad-for-the-economy",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Western Europe consumes almost 50% of the world's bottled water. Many claim that this is due to European culture, since the continent has had very polluted waters due to agriculture and industry dating back to the Industrial Revolution. The water bottles they buy help us."
  },
  {
    "id": "12567",
    "issue": "evolution-vs-creation",
    "stance_on_topic": "creation",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      1.0,
      1.0
    ],
    "text": "The scientific rigor you mention is not present in evolutionary theory. Here's one example: In the 1800s, Charles Lyell and others came up with dates for the rock strata. Radiometric dating wasn't invented until the 1900s. When it was invented, the techniques were calibrated to match the dates Lyell came up with. To say that this proves the dates that Lyell came up with is a logical fallacy, and it sure doesn't sound like true scientific rigor to me."
  },
  {
    "id": "arg230691",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "schools should have PE because the school i attend only has pe for middle school not high school we are a middle and a high school combined. because the lack of physical education in our high school many students are out of shape and have developed many bad non active habits and as our first year in sports our sports athletes have shown how hard it is to perform simple pre season conditioning and they quote \"if we had PE conditions would be easier and would have made conditioning simple\" the lack of exercise had caused them to only accomplish only 3 push-ups!"
  },
  {
    "id": "79918",
    "issue": "evolution-vs-creation",
    "stance_on_topic": "evolution",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "its simple, how would we be able to adapt to different enviroments. Over time we adapted to what suited us best otherwise why arn't we one skin colour, why are there so many types of animals"
  },
  {
    "id": "37929",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-choice",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      3.0,
      3.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      2.0
    ],
    "text": "Im going to take the Obama approach to this <br/> Abortion is never something a women would take lightly there will always be a lot of thinking asking for help and even praying involved with making that decision. The pro-life people just don't seam to understand that we also think the abortion is a sad and awful thing and we pro-choicers hope nobody would ever have to make this difficult and life altering situation. there for this decision should be left to the women and not some man miles away in d.c. that has never faced it"
  },
  {
    "id": "arg231491",
    "issue": "christianity-or-atheism",
    "stance_on_topic": "atheism",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "religious people are always using the same argument: you cant prove he doesn't exist!!!!you CANNOT disprove a negative. meaning, you cant prove something is not there,which already is not there."
  },
  {
    "id": "14007",
    "issue": "is-porn-wrong",
    "stance_on_topic": "no-is-is-not",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Porn isn't wrong, as long as you aren't doing it behind your partner's back. <br/> It's only degrading to the women who choose to pose."
  },
  {
    "id": "76359",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "it-has-a-cute-logo-oh-and-extensions-err-add-ons",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Firefox of course. And I like this website but I don't find it very clear. This one is better : theworlddebating.com"
  },
  {
    "id": "54187",
    "issue": "is-porn-wrong",
    "stance_on_topic": "yes-porn-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "If one is in a relationship then yes porn is wrong. No one has the right to tell others what to do, we can only hope to influence. Porn is disgusting. Seriously. It exploits men and women. It is not realistic and can split up relationships. <br/> If a man and a woman or a woman and a woman or man and a man are in a relationship then they should not need any other forms of sexual gratification other than their spouse. Out of love. And respect."
  },
  {
    "id": "arg33233",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "If my wife confided in me than I wouldn't betray her trust. She trusted me to support and help her and I would. I would be extremely angry and maybe even divorce her depending on what type of murder whether it be like a self defence murder or she just thought it would be fun."
  },
  {
    "id": "arg168822",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "yes-of-course",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "Raffles neglected Singapore when he went around conquering other 'more useful' countries for about FOUR years, leaving all the work to Farquhar to settle. Plus, to drive my point further, the countries that were run by Raffles all ended up BADLY. This shows that Raffles was a bad developer of the country."
  },
  {
    "id": "arg335090",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "Yes I believe you should spank a child only when they know they are wrong. The child will understand more if he is scared to do the same mistake. Actions speak louder than words."
  },
  {
    "id": "arg33069",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "personal-pursuit",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Human nature is to endeavor personal pursuit. If you assume that human nature is to endeavor advancing the common good, then you're going to get screwed by someone who endeavors personal pursuit. Most Americans endeavor advancing the common good; which is why they get screwed by politicians who endeavor personal pursuit. If everyone endeavors personal pursuit, then we would keep each other in check. It is easier to get most people to endeavor personal pursuit than it is to get most people to endeavor advancing the common good; which is why communism failed."
  },
  {
    "id": "14002",
    "issue": "is-porn-wrong",
    "stance_on_topic": "no-is-is-not",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "If pornography and the people who produce it were well respected by society, then no argument could be made that porn was degrading anyone. <br/> Likewise, if, as a society we were to berate movie actors (for example), then the act of being an actor would become degrading. <br/> It isn't the act of producing the porn that needs to change, but rather the acceptance of it in society."
  },
  {
    "id": "arg33280",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "Yes, if the person I loved and lived with murdered someone then I would definitely turn them in. Murder is premeditated and intentional so you never know if later on down the line they will turn on you."
  },
  {
    "id": "arg116888",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "yes-for",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "Yes. India does have the potential to lead the world. If the Indian government can look after a country with 28 states of 28 ways, culture, geographical and language, it can certainly can lead the world. For example, there is heavy rainfall in Manipur , while there is water scarcity in Rajasthan. It also has the most wonderful technological developments. Economically also India isn't that low. Eg: Chandrayaan from India discovered water on Moon. What do u say about that? And the father of astronomy, aryabhatta was from India."
  },
  {
    "id": "arg33339",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "Yes I would be happy and relieved to turn my spouse in for murder. Killing someone is the one number one crime in this world. I don't want to stay married to a crazy woman who commits murder. I wouldn't feel safe if we have children in the house or sleeping next to her. I wouldn't be able to sleep or think right for months, maybe years."
  },
  {
    "id": "54474",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-life",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "A growing embryo is considered human with the heartbeats initiating as early as 21st day of conception. So what if we cannot see the human form, it does have the potential to gain one. <br/> Around 60% of abortions are performed on never married women. Why can't women give the baby up for adoption instead, even if she is raped. If your raped does that give you the right to got out and kill someone?"
  },
  {
    "id": "arg35758",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "fatherless",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      3.0
    ],
    "effectiveness_scores": [
      3.0,
      1.0,
      2.0
    ],
    "text": "I would rather be \"fatherless\" then having a \"lousy father\", because a \"father\" is supposed to be the man of the house and set a good example so the rest of the family can look up to him. So if I look up at a lousy father I might then be a lousy person, but if I had no father then I'll set the standards for my own self and step up and be the man of the house especially if I had younger brothers or sisters."
  },
  {
    "id": "arg33129",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "advancing-the-common-good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "I volunteer at Irving Cares, and when I do I feel so great that I can help the community. To me when I help advance the common good I am helping myself. When people do something for the good of others it helps them out in the long run. Whether it is a favor in return or anything else. In a personal pursuit you are just helping yourself. If we all just helped ourselves where would our world be? We all depend on others for help at some point. This world should be about others, not just me."
  },
  {
    "id": "arg229317",
    "issue": "christianity-or-atheism",
    "stance_on_topic": "christianity",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "Christianity strives to promote better morals and ethics. What does atheism contribute? Nothing. To believe that one should follow the ways of Christ, what harm is there. Real or not, Christ is still a better example to follow than any atheist. For a ideology to be better than any human must really piss off those that fall way short of it."
  },
  {
    "id": "arg213296",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "books",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "When you read a book you economize your money. I would like to mention that when you read a book, you do not need to buy any devices for reading and it is not necessary to use electricity."
  },
  {
    "id": "arg33261",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      3.0,
      3.0
    ],
    "effectiveness_scores": [
      3.0,
      3.0,
      3.0
    ],
    "text": "As an ambitious, young person wanting to become a lawful, successful, homicide detective, I would not be lenient with any murderer in my midst. <br/> Hopefully, the murder wouldn't be the result of a pleasure/malicious-kill, so that the sentencing won't be as harsh, but nonetheless, all murderers must be tried. After all, hopefully my spouse will understand that having to live in hiding is basically the same as being in prison except much worse since there would be little chance for parole since they will have to live with the guilt and/or the fear of being caught for the rest of their lives."
  },
  {
    "id": "76796",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "Why don't we just get rid of any incentive to be married, politically that is. No tax deductions, no married filing jointly; nothing. Let the churches perform marriages, get the government out completely. If a particular denomination wants to condone homosexuality let them, it's them that are going against their religion. <br/> I don't support it. Like I said, if there were not tax breaks or incentives to be married in the eyes of the state, who cares. My church doesn't support it. It irks me that people who claim to Christians support it and even allow homosexual clergy."
  },
  {
    "id": "28068",
    "issue": "evolution-vs-creation",
    "stance_on_topic": "creation",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "\"Debates are based on convincing evidence. There is very little evidence supporting creation, while there are massive amounts supporting an evolutionary argument.\" <br/> True. But, evidence must withstand the test of accepted truth. We can't say that creation is false, because there is no explanation provided for the origins of the \"particles\" that caused the evolution theory. Although the evolution theory is interesting, and quite possible, it does not rule out creation. Since creation cannot be ruled out in any way, and evolution can, creation is the best possible theory."
  },
  {
    "id": "80510",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-right",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "Dosen't it say in the declaration of independence that we have the right to life liberty and the purist of happiness"
  },
  {
    "id": "arg168807",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "yes-of-course",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "William Farquhar had helped more citizen of Singapore than Raffles did. Raffles was just more of the idea man. William Farquhar was more of a founder of Singapore than Raffles."
  },
  {
    "id": "arg33342",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      3.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      3.0,
      1.0
    ],
    "text": "I would have to say yes. She committed murder, a thing that can get you in major trouble, even if you're an accompalice. I don't care what the reason was, it could have been accidental, there could have been someone trying to attack her, or whatever, she killed someone. The second she tells me, I wil call the police, just in case she either goes on another killing spree or decides to kill me"
  },
  {
    "id": "arg108959",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "no-against",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "india is is good adopter but a bad developer and leader should be a great developer"
  },
  {
    "id": "arg33282",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      1.0
    ],
    "text": "Yes, because who knows if they will turn on you and than one night that you less expect it they will try to kill you because its on their mind that you know the truth and the truth cant get out and they need to get rid of all types of clues even of those they love just incase they try to talk to someone."
  },
  {
    "id": "76937",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-life",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "I choose life. Keeping the law pro-choice is allowing women to murder their own unborn human child."
  },
  {
    "id": "arg238473",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "bad",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "Another reason for wearing a school uniform is good is that the uniform will always be decent. It will cover every part of the body that the school doesnt want the children to show and the students would not be cauntious about what they are wearing."
  },
  {
    "id": "42624",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "An action is ethical if society as a whole would benefit if we all did it. Fair enough? <br/> If everyone had a gay marriage, then society as a whole would NOT benefit. In fact, we would all become extinct, because without one man and one woman there would be no reproduction and continuation of our species. <br/> Therefore, gay marriage can't be ethical. <br/> You can't refute my statement by saying, \"There will always be straight people\" because that's like saying killing someone is right because there will always be those who won't kill."
  },
  {
    "id": "arg35616",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "fatherless",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      1.0,
      2.0
    ],
    "text": "Although being fatherless is probably one of the biggest hardships, undesired by all. I would rather be fatherless, than to have to deal with someone who on a daily basis would frustrate me. At least when you have no knowledge of a father, you only ponder on it from time to time. On the other hand, a lousy father would be with you in your thoughts forever."
  },
  {
    "id": "415",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "it-has-a-cute-logo-oh-and-extensions-err-add-ons",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Really great arguments why IE is supposed to be a better browser... NOT!"
  },
  {
    "id": "arg244440",
    "issue": "christianity-or-atheism",
    "stance_on_topic": "christianity",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "Atheism is based on science, but faith is based on the soul. An atheist is always looking for the absence of God, but religious person just believes. Atheism should be constantly fed, but faith shouldn't be. <br/> Although I'm religious person, I think atheist can stand to hear besause everyone is indepent and everyone has to have his own opinion."
  },
  {
    "id": "arg33319",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "I really don't know because i think it depends on who she murdered and how it happened. If it was self defense then no I wouldn't tell the police, but if she just went crazy and murdered someone then yes i would tell the police."
  },
  {
    "id": "arg168778",
    "issue": "william-farquhar-ought-to-be-honoured-as-the-rightful-founder-of-singapore",
    "stance_on_topic": "no-it-is-raffles",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      2.0
    ],
    "text": "FOUNDER IS NOT A PERSON WHO \"DISCOVERS\" A PLACE if so i can say the prince Sanila Utama is the founder of singapore!(this for some who say farquhar saw the island first) And I do know that farquer has been very involved in this help and sometimes even does all the work but let me remind you that being raffles \"assistant\" he still had to consult raffles and raffles had all authority over Singapore therefore he was given credit. Then i would like to ask u a question why then does the names \"raffles institution\" \"raffles hospital\" raffles medical clinics\""
  },
  {
    "id": "arg33289",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      3.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      3.0,
      2.0
    ],
    "text": "Yes definately i will turn him in to the police because he has commited a murder and its a sin. Maybe if he gets arrested,he can feel guilty for what he has done and try not to repeat it again. And also how can i trust a murderer?He can even be telling a lie to me and maybe can kill me for someone else in the future.so Just by confiding to me does not make him clean and innocent."
  },
  {
    "id": "arg219268",
    "issue": "ban-plastic-water-bottles",
    "stance_on_topic": "no-bad-for-the-economy",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Plastic is good light weight and a good for ditrabutions."
  },
  {
    "id": "823",
    "issue": "evolution-vs-creation",
    "stance_on_topic": "evolution",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Why not both? Why can't God have created a way for evolution to happen. <br/> Who says that God did it himself? <br/> Who says that God didn't cause the Big Bang or evolution to occur? <br/> FINAL ANSWER: EVOLUTION THROUGH CREATION"
  },
  {
    "id": "arg203869",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      3.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      2.0
    ],
    "text": "I think it's good within certain limits. I went to a school with a uniform, and it was far less stressful than non-uniform college. I'd argue that it's a leveler- prevents people from showing off material wealth/ making others feel bad for not having 'cool' stuff. <br/> But it can be taken too far. By the end, we weren't allowed coloured socks, which was idiotic."
  },
  {
    "id": "1661",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-choice",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "While I personally do not think that abortion is right in any way shape or form. I do not believe the government has the right to make that decision. This is a decision to be made by the parents of the unborn child. NOT the government."
  },
  {
    "id": "arg636360",
    "issue": "christianity-or-atheism",
    "stance_on_topic": "christianity",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "One of the key component to Christianity is FAITH. Just you because you can't see it doesn't mean it's not there. Gravity, for example, you can't see it, feel it, or hear it, but you know it's there. Faith to Christians is the same way."
  },
  {
    "id": "30319",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-life",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "Statistics prove that less than 1% of women who are raped get pregnant because of the adrenalin rush. We have no right to take an unborn child's life. There are ways to avoid the situation of abortion. The woman can have the baby and give it up for adoption or raise it as their own because the woman is the still the child's biological mother. There are thousands of people on the waiting list for another baby to add to their family. DO NOT let anyone tell you otherwise because they obviously havn't been in the situation of adoption or abortion."
  },
  {
    "id": "63512",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-choice",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      3.0,
      2.0
    ],
    "text": "Here's a story for you from a few years back. A nine year old girl living in poverty in South America was raped by her step dad, and got pregnant with twins. Her family knew that she would die in childbirth, but she was not allowed to get an abortion because they were devout catholics. Both her and her two children died. That's three lives lost. One of those lives actually knew what life was."
  },
  {
    "id": "arg33298",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      3.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      3.0,
      1.0
    ],
    "text": "If it was the person you truly love and want to spend the rest of your life with then it's a definitely no. People make mistakes but although it's a major crime to murder someone I would still not turn in the person I love the most. If I plan on staying with that person I love for the rest of my life then I would stick with them and never turn them in. And if that means that I am part of that murder by not saying anything, well then so be it."
  },
  {
    "id": "75146",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-life",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "what we are dealing with is indirect murder if a women decides to abort a child she just had killed a life that may have been a big contribution to society"
  },
  {
    "id": "arg39274",
    "issue": "should-physical-education-be-mandatory-in-schools",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "while yes phys. ed. classes should still be in high schools they shouldnt be mandatory(especially not all 4 years of HS). maybe just having PE be an optional class and having one year be a mandatory thing instead of a continuous PE class. in lower grades, yes it should be mandatory because little kids are more likely to gain and lose weight in weird patterns. That Is All."
  },
  {
    "id": "arg199159",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "bad",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      2.0,
      2.0
    ],
    "text": "I want to mention about wearing school uniform by high school students. it really makes no sense, it's the opposite, it just makes troubles within students and teachers relations. People aged 16-18 do not like any limits and sometimes limiting their freedom can become very serious problem followed by misunderstandings with the rest of people like parents and teachers. What about the controlling person's behavior - it must be done in the childhood, but not in the age when students become adults."
  },
  {
    "id": "arg251309",
    "issue": "is-the-school-uniform-a-good-or-bad-idea",
    "stance_on_topic": "bad",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      3.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      3.0,
      2.0
    ],
    "text": "The school my mother works at, plus the school district my cousin's 3 children are in, are utilizing school uniforms. One reason is to \"reduce bullying\", which in reality, doesn't even address the problem concerning bullying. The only good it does is that it gets rid of or reduces students being bullied because they aren't wearing a specific clothing label that they dictate is the IN thing to wear. While it's a problem, all it does is sweep the one basic type of bullying under the rug. Kids will find other reasons to bully others. It also infringes upon their basic rights to be individuals and to express their individuality."
  },
  {
    "id": "arg219204",
    "issue": "ban-plastic-water-bottles",
    "stance_on_topic": "yes-emergencies-only",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      2.0
    ],
    "text": "Yes I do feel that the consumption of water bottles should not be allowed anywhere unless in the case of emergency. Plastic bottles can leak chemicals after a period of time. Water bottles also are almost never recycled, and end up in landfills which lead to pollution of our environment. They take 700 years to start to decompose. 90% of the cost is the bottle itself... The water is usually tap water, and is not regulated. Even if tap water is dirty, you can easily clean it out with leaves, moss, and some water cleanser. Nearly one in five tested water bottles have bacteria anyway."
  },
  {
    "id": "arg223675",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "books",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      1.0,
      2.0
    ],
    "text": "I think books are better as TV can cause obesity as many people just sit infront of it, it has been proven to cause violence and it reduces learning. Also, books increase someones imagination and creativity as they have to imagine things in the book for themselves. <br/> I am not completely against TV but I do believe that TV is very bad in large amounts and books are very good for people <br/> http://www.echoworld.com/B05/B0510/B0510TVBad.htm"
  },
  {
    "id": "13279",
    "issue": "pro-choice-vs-pro-life",
    "stance_on_topic": "pro-life",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "In Nebraska, it's legal to have an abortion by killing the baby while it's coming out of the womb. How can you argue against that?"
  },
  {
    "id": "arg126374",
    "issue": "india-has-the-potential-to-lead-the-world",
    "stance_on_topic": "yes-for",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "India certainly has d potentials 2 lead d world...... <br/> in our real world power and weapons doesn't work any more <br/> maybe................................... <br/> maybe USA,UK or such other contries are more powerful but India is economically more strong.it is d hub 4 many other companies."
  },
  {
    "id": "arg35632",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "fatherless",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      2.0
    ],
    "text": "It's better to be fatherless. Having a lousy father creates a bigger gap in your life than being fatherless. It is a proven fact that if you're a girl, you'll look for someone to be your other half that's similar to your father. Having a lousy father, for a girl, would mean having a lousy boyfriend as well. By having no father you don't have to worry about how terrible they are and all you have to do is ponder how amazing your dad could have been. Wondering what could have been is better than wondering how much better it could be."
  },
  {
    "id": "arg33099",
    "issue": "personal-pursuit-or-advancing-the-common-good",
    "stance_on_topic": "advancing-the-common-good",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "advancing the common good is better to me because, If i were to pursue my own personal pursuit, it wouldn't be all that good, because most of them would be selfish choices that woulld end up hurting someone else, i dont like hurting people. It would be a much better world if we thought about everyone else well being before we think about our selves."
  },
  {
    "id": "arg289787",
    "issue": "christianity-or-atheism",
    "stance_on_topic": "christianity",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Christianity of course. Can't imagine life if I didn't believe in God. Actually I can, it would be hell."
  },
  {
    "id": "arg399268",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "tv",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "you can get the \"Foxtel Go\" app on your Ipad so you can watch TV where ever and whenever you want."
  },
  {
    "id": "arg229484",
    "issue": "christianity-or-atheism",
    "stance_on_topic": "atheism",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Even if there was a valid proof for the existence of god, there would be no valid proof that that god is Christian or not."
  },
  {
    "id": "530",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-right",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "EVERYONE, regardless of sexual orientation, has the right to be miserable. I say let gay people know the joys of divorce, splitting of assets, custody, alimony, child support, the whole nine yards! In fact, make civil unions illegal; it makes it too easy to \"walk away\" from a relationship and encourages roomates to be \"couples\" to help a buddy out with benefits.Civil Unions, gone, Gay marraige, IN!"
  },
  {
    "id": "76758",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-right",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      3.0,
      2.0
    ],
    "effectiveness_scores": [
      1.0,
      3.0,
      1.0
    ],
    "text": "Gay marriage is a lifestyle choice. It may be considered \"unnatural\", but that is between that person and his/her love interest. Love is all some people have... You can't take that one given right away because it makes you uncomfortable. They want acceptance and understanding. Let them be happy or just ignore it. You don't chose to be gay either. Who would chose to live that way? They are constantly being harrassed and can't be with their loved one. It's unfortunate and cruel. Please be respecful of them. They have done nothing wrong, God created them that way. 3"
  },
  {
    "id": "12383",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "there-s-more-browsers-than-the-ie-firefox-is-an-animal",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      2.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "I used to be a firefox user but I only have 2GBs of RAM on my system and I like to use more than one program at a time. Firefox sucks up way too much memory to justify the one or two advantages."
  },
  {
    "id": "arg33284",
    "issue": "if-your-spouse-committed-murder-and-he-or-she-confided-in-you-would-you-turn-them-in",
    "stance_on_topic": "yes",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      3.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      3.0,
      1.0
    ],
    "text": "In this situation it depends whether you knew the victim or if it was a stranger. If my husband killed a random stranger, then YES I would definitely turn him in because that considers him a psycho and what if he kills me too. But if he killed a person that I knew and that was harming us then I would think about it. It's most likely that I would turn him in just because I would be afraid to leave with a person like that, and also what if he thinks I will say something and kills me too."
  },
  {
    "id": "12421",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "The real issue is - why is the government involved in this issue at all? We take a personal, religious institution and regulate it, then the government comes back and wants to redefine it. <br/> It should not be a political issue, because my personal, religious things should be separate from government regulation. <br/> Marriage and the government should not mix. That solves the \"problem\"."
  },
  {
    "id": "12430",
    "issue": "gay-marriage-right-or-wrong",
    "stance_on_topic": "allowing-gay-marriage-is-wrong",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "If being homosexual was natural then <br/> 1. There would only be possibly 6 people on the earth...meaning none of the people making up these sarcastic remakes would be around....heck I wouldn't be around <br/> 2. If homosexuality was natural then the butthole would be in the front part of the body. <br/> Its never been accepted as \"natural\" by society only till now. So i'm pretty sure thousands of years of recorded human history have a little more weight than some piss ant liberal venting on how its unfair."
  },
  {
    "id": "arg35718",
    "issue": "is-it-better-to-have-a-lousy-father-or-to-be-fatherless",
    "stance_on_topic": "fatherless",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      1.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      1.0,
      2.0
    ],
    "text": "Honestly, I'd rather be completely fatherless, not saying that not having is better than having one, albeit a lousy one. However, I do believe that you can grow up completely fatherless and without any major male role model and still be successful. Take myself for example; I lived the first thirteen years of my life without a father or any fatherly interaction, and those were the essential times a kid needed to be around his/her father, I turned out great(Self-opinion). So yes, as opposed to having a lousy father that would rub off on me and mold me into half a man, I would much rather being fatherless."
  },
  {
    "id": "578317615",
    "issue": "evolution-vs-creation",
    "stance_on_topic": "evolution",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      3.0,
      2.0,
      2.0
    ],
    "effectiveness_scores": [
      3.0,
      2.0,
      2.0
    ],
    "text": "I call the god that creationists believe in the \"God of the Gaps.\" Early man's understanding of the universe was extremely limited. People did not know that earthquakes were caused by tectonic plates shifting. Therefore the idea of earthquakes being the work of an angry deity seemed logical, but man's understanding of the universe has grown significantly. We now know that current species came to be from billions of years of evolution. Supporting creationism is holding humanity back. We need to accept the facts and let religion fade away."
  },
  {
    "id": "arg135702",
    "issue": "tv-is-better-than-books",
    "stance_on_topic": "books",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      1.0,
      1.0
    ],
    "text": "Books will be always great whatever the new technological developments emerges books has its fixed place in every humans heart"
  },
  {
    "id": "arg335129",
    "issue": "human-growth-and-development-should-parents-use-spanking-as-an-option-to-discipline",
    "stance_on_topic": "no",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      1.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      1.0,
      2.0,
      1.0
    ],
    "text": "I don't think anybody would have liked to get spanked by there parents therefore , spanking shouldn't be an Option"
  },
  {
    "id": "12380",
    "issue": "firefox-vs-internet-explorer",
    "stance_on_topic": "there-s-more-browsers-than-the-ie-firefox-is-an-animal",
    "argumentative": [
      "y",
      "y",
      "y"
    ],
    "argument_quality_scores": [
      2.0,
      1.0,
      1.0
    ],
    "effectiveness_scores": [
      2.0,
      1.0,
      1.0
    ],
    "text": "I'm not an IE user but FFX has a lot of issues <br/> First, it does not start fast when it is loaded from the disk. For my 3 yr old computer, it takes about 10 or more seconds to start it, unlike the browser I use Opera it takes much less time to start. <br/> Plug-ins i frequently use such as Adobe Flash Player does not perfrom well in FFX. The flash movie often stops in FX unlike in Opera which plays flash movies smoothly. <br/> Lastly, Firefox is still young. I guess it is much better than IE. But for me Opera is still the best."
  }
]